Table of Contents
 Class IdeaTaper
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaTaper : AbstractIdeaObject<IIdeaTaper>, IEquatable<AbstractIdeaObject<IIdeaTaper>>, IIdeaTaper, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaTaper>
IdeaTaper
Implements
IEquatable<AbstractIdeaObject<IIdeaTaper>>
IIdeaTaper
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaTaper>.Id
 AbstractIdeaObject<IIdeaTaper>.Name
 AbstractIdeaObject<IIdeaTaper>.Identifier
 AbstractIdeaObject<IIdeaTaper>.GetHashCode()
 AbstractIdeaObject<IIdeaTaper>.Equals(object)
 AbstractIdeaObject<IIdeaTaper>.Equals(AbstractIdeaObject<IIdeaTaper>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaTaper(Identifier<IIdeaTaper>)
public IdeaTaper(Identifier<IIdeaTaper> identifer)
Parameters
identifer Identifier<IIdeaTaper>
 IdeaTaper(int)
public IdeaTaper(int id)
Parameters
id int
 IdeaTaper(string)
public IdeaTaper(string id)
Parameters
id string
Properties
 Spans
List of spans. Spans mut not overlap.
public virtual IEnumerable<IIdeaSpan> Spans { get; set; }
Property Value
IEnumerable<IIdeaSpan>
 Edit this page